#include "common.h"

#include "async_upload.h"
#include "gbaio.h"
#include "gbasvc.h"
#include "hardware.h"
#include "interrupts.h"
#include "proc.h"

#if defined(VER_20030206)
#include "debug_text.h"
#endif

#include "unknowns.h"

enum
{
#if !defined(VER_FINAL)
    SIO_UNK_C4 = 0x14,
#else
    SIO_UNK_C4 = 0xC4,
#endif
    SIO_UNK_C5,
    SIO_UNK_C6,
    SIO_UNK_C7,
    SIO_UNK_C8,
    SIO_UNK_C9,
    SIO_UNK_CA,
    SIO_UNK_CB,
    SIO_UNK_CC,
    SIO_UNK_CD,
    SIO_UNK_CE,
    SIO_UNK_CF,
};

// TODO: clean up structs

struct Sio_Unk_03002E40
{
    /* 00 */ u8 unk_00;
    /* 01 */ u8 unk_01;
    /* 02 */ u16 unk_02;
};

struct DatBody
{
    u16 unk_04;
    u8 unk_06[0x80];
};

struct Unk_Sio_134
{
    /* 00 */ u8 unk_00;
    /* 01 */ STRUCT_PAD(0x01, 0x04);
    /* 04 */ u8 unk_04;
    /* 05 */ u8 unk_05;
    /* 06 */ u16 unk_06;
    /* 08 */ u16 unk_08;
    /* 0A */ u8 unk_0A[0x80];
    /* 8A */ STRUCT_PAD(0x8A, 0x8C);
    /* 8C */ // end
};

struct Unk_Sio
{
    /* 000 */ u8 unk_000;
    /* 001 */ u8 unk_001;
    /* 002 */ u16 unk_002;
    /* 004 */ u16 unk_004;
    /* 006 */ i8 unk_006;
    /* 007 */ u8 unk_007;
    /* 008 */ u8 unk_008;
    /* 009 */ u8 unk_009;
    /* 00A */ u8 unk_00A;
    /* 00B */ u8 unk_00B[4];
    /* 00F */ u8 unk_00F;
    /* 010 */ u8 unk_010;
    /* 011 */ u8 unk_011;
    /* 012 */ u16 unk_012[4];
    /* 01A */ u8 unk_01A[4];
    /* 01E */ u8 unk_01E;
    /* 01F */ u8 unk_01F;
    /* 020 */ u8 unk_020;
    /* 021 */ u8 unk_021;
    /* 022 */ u16 unk_022;
    /* 024 */ u16 unk_024;
    /* 026 */ u16 unk_026[4];
    /* 02E */ u8 unk_02E;
    /* 02F */ STRUCT_PAD(0x02F, 0x030); // implicit
    /* 030 */ u16 unk_030;
    /* 032 */ u16 unk_032[0x80];
    /* 132 */ STRUCT_PAD(0x132, 0x134); // implicit
    /* 134 */ struct Unk_Sio_134 unk_134[8];
    /* 594 */ struct Unk_Sio_134 unk_594[4];
    /* 7C4 */ u8 unk_7C4;
    /* 7C5 */ u8 unk_7C5;
    /* 7C6 */ u8 unk_7C6;
    /* 7C7 */ u8 unk_7C7;
    /* 7C8 */ u16 unk_7C8;
    /* 7CA */ u16 unk_7CA;
    /* 7CC */ u16 unk_7CC;
    /* 7CE */ u16 unk_7CE;
};

struct Dat
{
    struct Sio_Unk_03002E40 head;
    struct DatBody body;
};

struct Unk_Sio EWRAM_DATA gUnk_Sio_0202F8B0 = { 0 };
struct Unk_Sio * SHOULD_BE_CONST gUnk_Sio_02018648 = &gUnk_Sio_0202F8B0;

u16 EWRAM_DATA gUnk_Sio_02030080[0x200] = { 0 };
u16 EWRAM_DATA gUnk_Sio_02030480[0x200][4] = { 0 };

static u8 s_sio_cnt;
static int s_sio_id;

static struct Unk_Sio_134 * s_unk_03000040;

static u32 s_unk_03000044;
static u16 s_unk_03000048;
static u16 s_unk_0300004A;

static int s_pad_0300004C;

static u16 s_unk_03000050[4];
static u16 s_unk_03000058[4];

// COMMON
extern int gUnk_Sio_03001C34;
extern int gSioStateId;
extern u32 gUnk_Sio_03001C30;
extern u8 gUnk_Sio_03002E50[0x80];
extern u16 gUnk_Sio_06_03001C30[4];
extern u16 gUnk_Sio_06_03001CC8[4];
extern u16 gUnk_Sio_06_03002E58[4];
extern struct Sio_Unk_03002E40 gUnk_Sio_03002E40;

// TODO: what to do here? This is improvable
struct Sio
{
    u16 siocnt;
    u16 siodata;
};

